{
  "home": "Arman Ayva Personal Website Arman Ayva Innovative Jazz-Fusion from Montreal. Welcome to the intersection of groove and melody. I’m Arman Ayva, a Montreal-based artist crafting a new language in Jazz-Fusion. My music lives in the space between live instrumentation and electronic exploration—where deep basslines meet complex, soulful arrangements. Latest Singles Arman Ayva – Video Library Explore my discography... My sound is fueled by the legacy of legends like Marcus Miller, US3, and Dave Brubeck. By blending Jazz-Funk with Ambient and Experimental elements, I strive to create music that is both intellectually stimulating and undeniably funky. New Interactive Experience The Musical Puzzle I built a custom tool that turns any YouTube video into a musical jigsaw. Can you reassemble your favorite tracks by ear? Start Playing Funky Jazz Mood Lifter Playlist Funky-Jazz-Mood-Lifter → New Releases & Highlights 🎵 New Single: Take Five, Get One In this track, Arman Ayva fuses **electronic textures, electric piano chords, and live bass grooves** into a lush instrumental story. It's a modern groove that feels both calm and alive, blending **Jazz Fusion, Electronic, and Ambient** genres. Key: F minor • BPM: 120 • Mood: Happy / Chill / Sexy Explore the Track Details The Pizzicata Blues (6 Tracks) A conversational album reflecting on the life of an indie artist, moving through playful funk (Pour In) and moody, soulful jazz (Je m'appelle Blues). See Full Track Story Montreal Heist: Criminal Case #68 A musical crime story in four songs: Rolling Buzz, Underground, Morning, and Criminal Case 68. A narrative-driven instrumental experience. Listen on All Platforms Stay Updated on Arman Ayva Projects Subscribe to receive the latest news, releases, and collaboration opportunities from Arman Ayva – Montreal Jazz Composer. Discover new tracks, playlists and upcoming projects first! Subscribe Now All Other Stories January 22, 2026 🛠️ The Architecture of a $0 Modern Website January 20, 2026 ",
  "about": "Arman Ayva Personal Website Arman Ayva – Montreal Jazz Composer & Hobbyist 🎷 Where modern jazz meets cinematic storytelling. Arman Ayva is a Montreal-based composer whose sound merges the soul of classic jazz with the freedom of funk and the mysticism of world music. From Lens to Loops: A Storyboard of Sound Before I began composing jazz, my world was framed through a camera lens. As a photographer and amateur filmmaker, I spent years capturing visual stories. Today, I use those same visual instincts to storyboard with sound. The Montreal Fusion: Armenian Soul meets Jazz-Funk Based in the creative crossroads of Montreal, my music is a deeply personal exploration of heritage and rhythm. I bridge the warmth of Armenian folk motifs with the high-energy freedom of 1970s fusion and analog synth textures. A Studio-First Philosophy I am not a performing artist; I am a studio-focused hobbyist dedicated to the architecture of sound. By focusing exclusively on production within Apple Logic Pro, I prioritize the intricate layering of live bass and global percussion. Beyond Composing: Curating the Vibe Creation is only half the journey. As the curator of the 'Funky Jazz Mood Lifter' playlist on Spotify, I connect with hundreds of followers who share a passion for bass-heavy grooves. Ready to dive into the music? Explore the Music & Cinematic Stories → Music Production & Licensing Disclaimer All music compositions presented on this website are original works produced by Arman Ayva. We adhere to the highest standards of artistic and legal integrity. Technical Production Details These works are created primarily using Apple Logic Pro and professional digital audio tools. Some compositions may include sounds or samples from the Logic Pro library. Royalty-Free Usage (Apple Logic Pro) According to Apple Inc.’s Logic Pro Software License Agreement, all Apple-provided loops and samples are royalty-free for use in original compositions and can be distributed and monetized. Artistic Inte",
  "videos": "Arman Ayva Personal Website Watch & Listen: Arman Ayva on YouTube 🎥 Dive into my visual and sonic stories. From full-length album visualizers to official Topic channel playlists, explore the cinematic jazz fusion of Arman Ayva. Arman Ayva – Topic Channel Official auto-generated Topic channel for full catalog listening. Classic Folk Armenian Humanity is stepping into the AI age—it’s only the beginning. Some are frightened, some resist, but me? I’m excited. I can’t wait for the day I see an intelligent robot walking down the street. The Shrink-Ep.1 -And The Journey Begins (Pilot) - Satirical Sci-Fi The full musical crime story in one visual experience. Stuck in the Past – Jazz Funk Fusion by Arman Ayva (Official Video) The original instrumental jazz score capturing.  Release Date: Sep 1- 2025. Spotify: Arman Ayva",
  "radio": "Arman Ayva Personal Website Arman Ayva's Detached Radio 📻 Tune into a curated selection of great radio—from Montreal classics and New York grooves to chill jazz stations and my own featured music playlist. Enjoy the mix! CHOM 97.7 (Montreal Rock) Noël c'est Rouge (Holiday) CJAD 800 (Montreal News) Arman Ayva Music Playlist (YouTube) 95.9 Virgin Radio (Pop) Vinyl Jazz (iHeart) iHeartJazz Classics CHUM 104.5 (Toronto Pop) Q104.3 (New York Rock) Power 105.1 (New York Hip Hop)",
  "arcade": "The Musical Puzzle | Arman Ayva | Arman Ayva ← Back to Home The Musical Puzzle I built a custom tool that turns any YouTube video into a musical jigsaw. Can you reassemble your favorite tracks by ear? 1. Pick & Listen Choose a demo track or search any video. 2. Reassemble Drag and drop scrambled pieces by ear. 3. Level Up Solve puzzles to unlock the next level.",
  "privacy": "Arman Ayva Personal Website Privacy Policy Last updated: Jan 27, 2026 1. Overview This Privacy Policy describes how your personal information is collected, used, and shared when you visit https://www.armanayva.com . We are committed to protecting your privacy, specifically in compliance with **Quebec's Law 25 (Bill 64)** regarding the protection of personal information. 2. Information We Collect When you visit the Site, we automatically collect certain information via: ● Vercel Analytics: Device type, browser, and general location (City/Country) for performance monitoring. ● Google Analytics: Interaction data to help us understand which blog posts or music projects are most popular. ● TikTok Pixel: Conversion tracking to measure the effectiveness of our music promotion. 3. AI & Neural Interactions Interactions with Professor Groove are processed via the Groq API (Llama 3.3) . Conversations are transient and are not stored on our servers, nor are they used to train third-party AI models. We do not link chat history to your personal identity.This agent features a local fallback mode to ensure service continuity. When the primary neural engine is over-capacity, a local rule-based response system is activated. 4. Third-Party Services Our site includes embeds from YouTube, Spotify, Bandcamp, and JotForm . These third parties may collect your IP address and use cookies if you interact with their players or forms. We recommend reviewing their respective privacy policies. 5. Your Rights & Law 25 Under Quebec's Law 25, you have the right to access, rectify, or request the deletion of your personal data. You may also withdraw your consent to data collection at any time. For any inquiries regarding your privacy, please contact **Arman Ayva** via the contact form on this site.",
  "medium_article": "Title: Just a moment...\n\nURL Source: https://medium.com/@arman_ayva/the-architecture-of-a-0-modern-website-a0440766ebf2\n\nWarning: Target URL returned error 403: Forbidden\nWarning: This page maybe requiring CAPTCHA, please make sure you are authorized to access this page.\n\nMarkdown Content:\n![Image 1: Icon for medium.com](https://medium.com/favicon.ico)medium.com\n-------------------------------------------------------------------------\n\nVerify you are human by completing the action below.\n\nmedium.com needs to review the security of your connection before proceeding."
}